"""

Домашнее задание №1

Условный оператор: Возраст

* Попросить пользователя ввести возраст при помощи input и положить
  результат в переменную
* Написать функцию, которая по возрасту определит, чем должен заниматься пользователь:
  учиться в детском саду, школе, ВУЗе или работать
* Вызвать функцию, передав ей возраст пользователя и положить результат
  работы функции в переменную
* Вывести содержимое переменной на экран

"""

def main(user_age):
    if user_age <= 6:
        return('Вы в садике')
    elif user_age <= 16:
        return('Вы в школе')
    elif user_age <= 21:
        return('Вы в университете')
    else:
        return('Вы работаете')

user_age = input ("Сколько вам лет? ")
result = main(int(user_age))
print(result)

