"""

Домашнее задание №1

Цикл while: ask_user со словарём

* Создайте словарь типа "вопрос": "ответ", например:
  {"Как дела": "Хорошо!", "Что делаешь?": "Программирую"} и так далее
* Напишите функцию ask_user() которая с помощью функции input()
  просит пользователя ввести вопрос, а затем, если вопрос есть
  в словаре, программа давала ему соотвествующий ответ. Например:

    Пользователь: Что делаешь?
    Программа: Программирую

"""

questions_and_answers = {
    'Что делаешь?': 'С тобой разговариваю',
    'Как дела?': 'Хорошо',
    'А потом что будешь делать?': 'Отдыхать',
    'Ты кто?': 'Программа',
    'Как тебя зовут?': 'questions_and_answers'
    }

def ask_user():
    while True:
        user_question = input('Задай мне вопрос ')

        if user_question in questions_and_answers:
            print(questions_and_answers[user_question])
        else:
            input('На этот вопрос не знаю ответа ')


ask_user()
